In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [ ]:
! pip install kaggle

In [ ]:
from google.colab import files
files.upload()

In [ ]:
! mkdir ~/.kaggle
! cp kaggle.json ~/.kaggle/
! chmod 600 ~/.kaggle/kaggle.json

In [ ]:
df_train = pd.read_csv('/content/Case Study Chapter 2 Topic 6_ Data Train.csv')

In [ ]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df_train.duplicated().sum()

0

In [ ]:
df_train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [ ]:
df_train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [ ]:
df_train['Cabin'].value_counts()

B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: Cabin, Length: 147, dtype: int64

In [ ]:
df_train['Ticket'].value_counts()

347082      7
CA. 2343    7
1601        7
3101295     6
CA 2144     6
           ..
9234        1
19988       1
2693        1
PC 17612    1
370376      1
Name: Ticket, Length: 681, dtype: int64

In [ ]:
df_train['Parch'].value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [ ]:
df_train['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [ ]:
df_train['Age'] = df_train['Age'].fillna(df_train['Age'].median())

In [ ]:
df_train['Cabin'] = df_train['Cabin'].fillna(df_train['Cabin'].mode()[0])
df_train['Embarked'] = df_train['Embarked'].fillna(df_train['Embarked'].mode()[0])

In [ ]:
df_train.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [ ]:
df_train_new = df_train.drop(['PassengerId', 'Name'], axis=1)

In [ ]:
data_numerik = df_train_new.select_dtypes(include=[np.number]).columns
data_numerik

Index(['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [ ]:
numerik_data = ['Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [ ]:
from sklearn.preprocessing import MinMaxScaler
skaler = MinMaxScaler()
df_train_new[numerik_data] = skaler.fit_transform(df_train_new[numerik_data])

In [ ]:
print(df_train_new[numerik_data].describe().T[['min', 'max']])

        min  max
Pclass  0.0  1.0
Age     0.0  1.0
SibSp   0.0  1.0
Parch   0.0  1.0
Fare    0.0  1.0

In [ ]:
data_kategori = df_train_new.select_dtypes(exclude=[np.number]).columns
data_kategori

Index(['Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [ ]:
from sklearn.preprocessing import LabelEncoder
en = LabelEncoder()

df_train_new['Sex'] = en.fit_transform(df_train_new['Sex'])

df_train_new['Ticket'] = en.fit_transform(df_train_new['Ticket'])

df_train_new['Cabin'] = en.fit_transform(df_train_new['Cabin'])

df_train_new['Embarked'] = en.fit_transform(df_train_new['Embarked'])

In [ ]:
df_train_new

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1.0,1,0.271174,0.125,0.000000,523,0.014151,47,2
1,1,0.0,0,0.472229,0.125,0.000000,596,0.139136,81,0
2,1,1.0,0,0.321438,0.000,0.000000,669,0.015469,47,2
3,1,0.0,0,0.434531,0.125,0.000000,49,0.103644,55,2
4,0,1.0,1,0.434531,0.000,0.000000,472,0.015713,47,2
...,...,...,...,...,...,...,...,...,...,...
886,0,0.5,1,0.334004,0.000,0.000000,101,0.025374,47,2
887,1,0.0,0,0.233476,0.000,0.000000,14,0.058556,30,2
888,0,1.0,0,0.346569,0.125,0.333333,675,0.045771,47,2
889,1,0.0,1,0.321438,0.000,0.000000,8,0.058556,60,0
890,0,1.0,1,0.396833,0.000,0.000000,466,0.015127,47,1

In [ ]:
df_train_new.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Cabin       0
Embarked    0
dtype: int64

In [ ]:
X = df_train_new.drop(['Survived'], axis=1)
y = df_train_new['Survived']

print('jumlah shape', X.shape)
print('jumlah shape', y.shape)

jumlah shape (891, 9)
jumlah shape (891,)

In [ ]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

print('jumlah shape X_train : ', X_train.shape)
print('jumlah shape X_test : ', X_test.shape)
print('jumlah shape y_train : ', y_train.shape)
print('jumlah shape y_test : ', y_test.shape)

jumlah shape X_train :  (712, 9)
jumlah shape X_test :  (179, 9)
jumlah shape y_train :  (712,)
jumlah shape y_test :  (179,)

In [ ]:
from sklearn.ensemble import RandomForestClassifier

model_RF = RandomForestClassifier()
model_RF = model_RF.fit(X_train, y_train)
y_pred = model_RF.predict(X_test)

In [ ]:
from sklearn.metrics import classification_report, confusion_matrix

print('Training Accuracy :', model_RF.score(X_train, y_train))
print('Testing Accuracy :', model_RF.score(X_test, y_test))

Training Accuracy : 0.9985955056179775
Testing Accuracy : 0.8715083798882681

In [ ]:
print('\nConfusion matrix:')
cm = confusion_matrix(y_test, y_pred)
print(cm)

Confusion matrix:
[[104   6]
 [ 17  52]]

In [ ]:
print('\nClassification report:')
cr = classification_report(y_test, y_pred)
print(cr)

Classification report:
              precision    recall  f1-score   support

           0       0.86      0.95      0.90       110
           1       0.90      0.75      0.82        69

    accuracy                           0.87       179
   macro avg       0.88      0.85      0.86       179
weighted avg       0.87      0.87      0.87       179

In [ ]:
df_tes = pd.read_csv('/content/Case Study Chapter 2 Topic 6_ Data Test.csv')

In [ ]:
df_tes.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [ ]:
df_tes.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
df_tes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [ ]:
df_tes['Age'] = df_tes['Age'].fillna(df_tes['Age'].median())
df_tes['Fare'] = df_tes['Fare'].fillna(df_tes['Fare'].median())

In [ ]:
df_tes['Cabin'] = df_tes['Cabin'].fillna(df_tes['Cabin'].mode()[0])

In [ ]:
df_tes.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [ ]:
df_tes[numerik_data] = skaler.fit_transform(df_tes[numerik_data])

In [ ]:
df_tes['Sex'] = en.fit_transform(df_tes['Sex'])

df_tes['Ticket'] = en.fit_transform(df_tes['Ticket'])

df_tes['Cabin'] = en.fit_transform(df_tes['Cabin'])

df_tes['Embarked'] = en.fit_transform(df_tes['Embarked'])

In [ ]:
df_tes

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,1.0,"Kelly, Mr. James",1,0.452723,0.000,0.000000,152,0.015282,15,1
1,893,1.0,"Wilkes, Mrs. James (Ellen Needs)",0,0.617566,0.125,0.000000,221,0.013663,15,2
2,894,0.5,"Myles, Mr. Thomas Francis",1,0.815377,0.000,0.000000,73,0.018909,15,1
3,895,1.0,"Wirz, Mr. Albert",1,0.353818,0.000,0.000000,147,0.016908,15,2
4,896,1.0,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,0.287881,0.125,0.111111,138,0.023984,15,2
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,1.0,"Spector, Mr. Woolf",1,0.353818,0.000,0.000000,267,0.015713,15,2
414,1306,0.0,"Oliva y Ocana, Dona. Fermina",0,0.512066,0.000,0.000000,324,0.212559,22,0
415,1307,1.0,"Saether, Mr. Simon Sivertsen",1,0.505473,0.000,0.000000,346,0.014151,15,2
416,1308,1.0,"Ware, Mr. Frederick",1,0.353818,0.000,0.000000,220,0.015713,15,2
417,1309,1.0,"Peter, Master. Michael J",1,0.353818,0.125,0.111111,105,0.043640,15,0

In [ ]:
testing = df_tes.copy()

In [ ]:
testing.shape

(418, 11)

In [ ]:
testing.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,1.0,"Kelly, Mr. James",1,0.452723,0.000,0.000000,152,0.015282,15,1
1,893,1.0,"Wilkes, Mrs. James (Ellen Needs)",0,0.617566,0.125,0.000000,221,0.013663,15,2
2,894,0.5,"Myles, Mr. Thomas Francis",1,0.815377,0.000,0.000000,73,0.018909,15,1
3,895,1.0,"Wirz, Mr. Albert",1,0.353818,0.000,0.000000,147,0.016908,15,2
4,896,1.0,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,0.287881,0.125,0.111111,138,0.023984,15,2

In [ ]:
testing_new = testing.drop(['PassengerId', 'Name'], axis=1)

In [ ]:
final_pred_RF = model_RF.predict(testing_new)

In [ ]:
output_RF = pd.DataFrame({'PassengerId': df_tes.PassengerId, 'Name': df_tes.Name, 'Survive': final_pred_RF })

In [ ]:
output_RF.to_csv('hasi_pres2.csv', index=False)

In [ ]:
df_pred = pd.read_csv('/content/hasi_pres2.csv')

In [ ]:
df_pred

     PassengerId                                          Name  Survive
0            892                              Kelly, Mr. James        0
1            893              Wilkes, Mrs. James (Ellen Needs)        0
2            894                     Myles, Mr. Thomas Francis        0
3            895                              Wirz, Mr. Albert        0
4            896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)        1
..           ...                                           ...      ...
413         1305                            Spector, Mr. Woolf        0
414         1306                  Oliva y Ocana, Dona. Fermina        1
415         1307                  Saether, Mr. Simon Sivertsen        0
416         1308                           Ware, Mr. Frederick        0
417         1309                      Peter, Master. Michael J        1

[418 rows x 3 columns]